{
  "id": "projects",
  "content": [
    {
        "project": "eatco",
        "title": "eatco",
        "index": 1,
        "tech": ["react", "flask", "sql"],
        "link": "https://github.com/Shivam-J-07/eatco",
        "devpostLink": "https://devpost.com/software/eatco",
        "video": "https://www.youtube.com/embed/E1fSFT5oQjs?start=44",
        "content": {
          "DESCRIPTION": "An eco-conscious recipe app that encourages users to eat less meat, reducing their carbon footprint.",
          "HOW_I_BUILT_IT": [
            "I developed the front-end of this project using React to create the different views, making it a single-page web app. I used React Router to switch between views.",
            "I designed and built this over a span of 36 hours with one of my other team members. We worked with the rest of our team to set up a full stack app that could send and receive data to and from the back-end, including users' saved recipes, history, and requests to the Spotify API."
          ]
        }
      },
      {
        "project": "SPOT",
        "title": "SPOT",
        "index": 0,
        "tech": ["django", "sql"],
        "link": "https://github.com/alyssadsouza/SPOT",
        "devpostLink": "https://devpost.com/software/spot-oc28w1",
        "video": "https://www.youtube.com/embed/IE0xMSTcOe8",
        "content": {
          "DESCRIPTION": "A beginner friendly project manager to encourage young developers starting out to take on side projects.",
          "HOW_I_BUILT_IT": [
            "I built this solo at a hackathon after first learning about web programming in Python and JavaScript. I used Django because it was the only framework I knew at the time.",
            "It set up the SQLite database for me, and I accessed and updated it through the back-end to create users for the app and store their account data, namely projects and tasks. I designed the app and styled it with Sass and plain HTML."
          ]
        }
      },
      {
        "project": "Terms and Procrastination",
        "title": "Terms and Procrastination",
        "index": 2,
        "color": "secondary",
        "tech": ["react", "flask", "mongodb", "pytorch"],
        "link": "https://github.com/alyssadsouza/ht6-2022",
        "devpostLink": "https://devpost.com/software/terms-and-procrastination",
        "video": "https://www.youtube.com/embed/DQGtgrXZQDM",
        "content": {
          "DESCRIPTION": "A chrome extension that keeps you informed of your privacy by parsing webpages you visit for their terms and privacy policy and provides a simplified summary of them.",
          "HOW_I_BUILT_IT": [
            "I implemented the front-end and created a React app which we built as a Chrome extension for a better user experience. It was my first time building a Chrome extension which could interact with the current tab, which is how we parsed its content.",
            "I also setup the Mongo database in the back-end and added integration for users to allow sites to be whitelisted and blacklisted specific to each user."
          ]
        }
      }
  ]
}
