{
  "id": "projects",
  "content": [
    {
        "project": "eatco",
        "title": "Eatco",
        "creation_date": "July 1, 2022",
        "tech": ["React", "Flask", "SQL"],
        "link": "https://github.com/Shivam-J-07/eatco",
		"devpostLink": "https://devpost.com/software/eatco",
        "video": "https://www.youtube.com/embed/E1fSFT5oQjs?start=44",
        "thumbnail": "https://img.youtube.com/vi/E1fSFT5oQjs/maxresdefault.jpg",
        "content": {
          "DESCRIPTION": "An eco-conscious recipe app that encourages users to eat less meat, reducing their carbon footprint.",
          "HOW_I_BUILT_IT": [
            "I developed the front-end of this project using React to create the different views, making it a single-page web app. I used React Router to switch between views.",
            "I designed and built this over a span of 36 hours with one of my other team members. We worked with the rest of our team to set up a full stack app that could send and receive data to and from the back-end, including users' saved recipes, history, and requests to the Spotify API."
          ]
        }
      },
      {
        "project": "terms-and-procrastination",
        "title": "Terms and Procrastination",
        "creation_date": "Aug 19, 2022",
        "color": "secondary",
        "tech": ["React", "Flask", "MongoDB", "PyTorch"],
        "link": "https://github.com/alyssadsouza/ht6-2022",
		"devpostLink": "https://devpost.com/software/terms-and-procrastination",
        "video": "https://www.youtube.com/embed/DQGtgrXZQDM",
        "thumbnail": "https://img.youtube.com/vi/DQGtgrXZQDM/maxresdefault.jpg",
        "content": {
          "DESCRIPTION": "A chrome extension that keeps you informed of your privacy by parsing webpages you visit for their terms and privacy policy and provides a simplified summary of them.",
          "HOW_I_BUILT_IT": [
            "I implemented the front-end and created a React app which we built as a Chrome extension for a better user experience. It was my first time building a Chrome extension which could interact with the current tab, which is how we parsed its content.",
            "I also setup the Mongo database in the back-end and added integration for users to allow sites to be whitelisted and blacklisted specific to each user."
          ]
        }
      },
      {
        "project": "spot",
        "title": "SPOT",
        "creation_date": "June 5, 2021",
        "tech": ["Django", "SQL"],
        "link": "https://github.com/alyssadsouza/SPOT",
		"devpostLink": "https://devpost.com/software/spot-oc28w1",
        "video": "https://www.youtube.com/embed/IE0xMSTcOe8",
        "thumbnail": "https://img.youtube.com/vi/IE0xMSTcOe8/maxresdefault.jpg",
        "content": {
          "DESCRIPTION": "A beginner friendly project manager to encourage young developers starting out to take on side projects.",
          "HOW_I_BUILT_IT": [
            "I built this solo at a hackathon after first learning about web programming in Python and JavaScript. I used Django because it was the only framework I knew at the time.",
            "It set up the SQLite database for me, and I accessed and updated it through the back-end to create users for the app and store their account data, namely projects and tasks. I designed the app and styled it with Sass and plain HTML."
          ]
        }
      },
      {
        "project": "savvant",
        "title": "Savvant",
        "creation_date": "Feb 18, 2023",
        "tech": ["React", "TypeScript", "Fast API", "Cohere API", "NLTK"],
        "link": "https://github.com/alyssadsouza/savvant",
		"devpostLink": "https://devpost.com/software/savvant",
        "video": "https://www.youtube.com/embed/Z87lOSmQRqs",
        "thumbnail": "https://img.youtube.com/vi/Z87lOSmQRqs/maxresdefault.jpg",
        "content": {
          "DESCRIPTION": "An NLP app that processes e-commerce reviews with sentiment analysis to help determine if you should buy a product.",
          "HOW_I_BUILT_IT": [
            "I designed and implemented the UI for this, as well as set up the backend API endpoints and helped with some of the data processing and integration for the app.",
            "We used React with Typescript and Tailwind for styling. We used React Router for the routing and the Axios library for making our API requests.",
            "For the backend I tried out FastAPI for the first time and had simple GET requests to our API, which would run its major processing using custom web scrapers, Cohere's API for sentiment analysis, and the nltk Python library for adjective counts."
          ]
        }
      },
      {
        "project": "recycle",
        "title": "ReCycle",
        "creation_date": "Sept 17, 2022",
        "tech": ["React", "Flask", "CockroachDB", "WebSocket", "Google Maps API"],
        "link": "https://github.com/Shivam-J-07/ReCycle",
		"devpostLink": "https://devpost.com/software/recycle-9eu6j0",
        "video": "",
        "images": [
          "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/226/390/datas/gallery.jpg", 
          "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/226/394/datas/gallery.jpg",
          "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/226/395/datas/gallery.jpg"
        ],
        "thumbnail": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/226/390/datas/gallery.jpg",
        "content": {
          "DESCRIPTION": "Recycle bikes in your community with organized bike loans and rentals from people in your area.",
          "HOW_I_BUILT_IT": [
            "I designed and implemented the UI for this application with React, which involved integrating the Google Maps API and backend API calls for the chat messaging feature and map directions.",
            "I used React Router to do the routing between the three different pages and simple API fetch calls to communicate with the backend.",
            "The hardest part was probably integrating Google Maps because of the small but frequent bugs we were runnning into just displaying custom markers to show multiple available bikes on the map."
          ]
        }
      }
  ]
}
